app/controllers/entries_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  @entry = Entry.find(params["id"])